{
  "header-title": "Personal Resume",
  "header-about": "About",
  "header-projects": "Projects",
  "header-contact": "Contact",
  "home-title": "Hi, I'm <br />Vic Wu.",
  "home-card-sub": "Front-End Engineer",
  "home-card-content": "I love building intuitive interfaces and exploring AI tools for better productivity. Here’s my work — let’s connect.",
  "about-banner-main-label": "No Limit in Tech, No Limit in Life.",
  "about-banner-sub-label": "Learning is not about speed<br />it's about lasting longer in the game.",
  "about-introduce-title": "Hello! I'm Vic<br />A Front-End Engineer.",
  "about-introduce-content": "I’m stepping into my 30s and have realized that I’m passionate about trying new things.<br />I want to meet like-minded people and create more memories and experiences in my life.",
  "about-yoga-title": "From Stiff Shoulders to Inner Peace",
  "about-yoga-content": "As an engineer, I spent long hours sitting in front of a computer, slowly developing poor posture and stiff shoulders.<br /><br />One day, I realized this lifestyle wasn’t sustainable at all.<br /><br />By chance, I stepped into a yoga class — and unexpectedly fell in love with it.<br /><br />Since 2022, yoga has become a part of my life, helping me find balance both physically and mentally. It’s not just about flexibility — it’s about feeling good in my body and calming my mind.",
  "about-hyrox-title": "Everything I Trained for — Gone in Minutes",
  "about-hyrox-content": "My first HYROX experience — and the energy on site was insane.<br /><br />I just wanted to try out the 4-person relay, but that 2K run + 2 workouts turned out to be an all-out sprint that completely burned me out.<br /><br />HYROX is brutal, but addictive. For someone who loves strength training, this mix of cardio and weights is exactly my kind of fun.<br /><br />It’s not about the results — what I love most is the process: preparing before the race, going all in during the race, and reflecting after.<br /><br />That’s the beauty of training.",
  "about-run-title": "Turning Point — Chasing My First Sub-3 Marathon",
  "about-run-content": "I joined my first half marathon without any training — and paid the price with severe knee pain. That moment made me realize how important running form and proper training are.<br /><br />In early 2024, I joined a running club, gradually improved my pace, and met a group of passionate runners who keep inspiring me.<br /><br />Running is no longer just about speed. It’s about challenging myself and growing stronger, step by step.<br /><br />My goal is simple — keep running, keep improving, and chase my first sub-3 marathon.",
  "about-climb-mountain-title": "Tired Legs, Full Heart",
  "about-climb-mountain-content": "I used to think hiking Hehuan Mountain was already a big achievement — until I said yes without hesitation to my friend’s invitation to challenge the Biyang Ridge one-day hike.<br /><br />The journey was breathtaking. From lush green valleys to endless blue skies, every step reminded me of how magnificent nature can be.<br /><br />Although I was completely exhausted and clumsy on the way down, the memories of the stunning views and the joy of completing the challenge filled me with pure satisfaction.<br /><br />It was truly an unforgettable adventure.",
  "about-bike-title": "Riding into the Mountains",
  "about-bike-content": "After signing up for the 99.9K challenge, I finally made the decision to buy my very first road bike — and that marked the beginning of my journey into the mountains.<br /><br />Riding along winding mountain roads, feeling the breeze on my face, and moving faster through nature brought a whole new sense of freedom.<br /><br />There’s nothing quite like the thrill of speed and the breathtaking scenery rushing past me. It’s an experience beyond words.",
  "about-conclusion-title": "The Best Part of Life Happens Outside Your Comfort Zone",
  "about-conclusion-content": "I've come to realize —<br /><br />The best part of life happens when you step out of your comfort zone.<br /><br />From running my first half marathon without training, to hiking an entire mountain ridge in one day, to joining my first HYROX race — none of these started because I was ready.<br /><br />They started because I wanted to see how far I could go.<br /><br />Every new challenge — running, hiking, yoga, skiing, triathlon — has helped me break my own limits and understand myself a little more.<br /><br />You never really know what you're capable of — until you try.<br /><br />Along the way, I've gained health, confidence, and most importantly, friends who love to challenge themselves and grow together.<br /><br />This is the energy I want to keep — to keep exploring, stay curious, and share my stories with those who are also on their way.",
  "contact-name": "Name",
  "contact-name-placeholder": "Enter your name",
  "contact-email": "Email",
  "contact-email-placeholder": "Enter your email",
  "contact-message": "Message",
  "contact-message-placeholder": "Enter your message",
  "contact-submit": "Submit"
}
